HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-LORA-BME280/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32s3"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

# Flash size (detected 8 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8mb"

# ADC Calibration: ESP32-S3 uses curve fitting
CONFIG_ADC_CALI_CURVE_FITTING_ENABLE=y
